In [3]:
import sqlite3

In [4]:
con = sqlite3.connect('student.sqlite3')

In [5]:
cur = con.cursor()

In [7]:
CREATE_TABLE_QUERY = """

CREATE table student(
	id int primary key,
	name varchar not null,
	address varchar not null,
	college varchar not null,
	age int not null,
	gender varchar(1) not null,
	faculty varchar not null
);

"""
cur.execute(CREATE_TABLE_QUERY)

In [8]:
INSERT_RECORDS = """

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
values
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f','CE');

"""
cur.execute(INSERT_RECORDS)

In [9]:
con.commit()

In [11]:
students = cur.execute("SELECT * from student;")
print(students)

for student in students:
    print(student)

students = cur.execute("SELECT * from student where age > 18;")
for student in students:
    print(student)

cur.execute("ALTER table student add university default 'TU';")

con.commit()

cur.execute("""

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
values
(5, 'hari', 'kathmandu', 'ioe pulchowk', 24, 'm','CIVIL', 'ku'),
(6, 'madan', 'pokhara', 'ncit', 21, 'f', 'SE', 'tu'),
(7, 'maya', 'kathmandu', 'isglington', 24, 'f','BIT', 'tu');

""")

con.commit()

students = cur.execute("SELECT * from student where address = 'lalitpur';")
for student in students:
    print(student)

address = input("Enter the address: ")

students = cur.execute(f"SELECT * from student where address = '{address}';")
for student in students:
    print(student)

address = input("Enter the address: ")

students = cur.execute(f"SELECT * from student where address = '{address}';")
for student in students:
    print(student)

# SELECT * from student where address = 'lalitpur' or address = 'kathmandu'

address = input("Enter the address: ")

students = cur.execute("SELECT * from student where address = ?;", (address,))
for student in students:
    print(student)

address = input("Enter the address: ")

students = cur.execute("SELECT * from student where address = ?;", (address,))
for student in students:
    print(student)

student = (11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', "IT", "TU")

INSERT_RECORDS = """

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);

"""

cur.execute(INSERT_RECORDS, student)

con.commit()

students = [
    (8, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', "SE", "PU"),
    (9, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', "IT", 'UK'),
    (10, 'maya devi', 'lalitpur', 'ncit', 21, 'f', "CE", "PU"),
]

for student in students:
    INSERT_RECORDS = """
    
    INSERT into student 
    ('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
    values
    (?, ?, ?, ?, ?, ?, ?, ?);
    
    """
    
    cur.execute(INSERT_RECORDS, student)
    
    con.commit()

students = [
    (13, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', "SE", "PU"),
    (14, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', "IT", 'UK'),
    (15, 'maya devi', 'lalitpur', 'ncit', 21, 'f', "CE", "PU"),
]

INSERT_RECORDS = """

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);

"""

cur.executemany(INSERT_RECORDS, students)

con.commit()

<sqlite3.Cursor object at 0x000001944344B7C0>
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'TU')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE', 'TU')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'TU')
(5, 'hari', 'kathmandu', 'ioe pulchowk', 24, 'm', 'CIVIL', 'ku')
(6, 'madan', 'pokhara', 'ncit', 21, 'f', 'SE', 'tu')
(7, 'maya', 'kathmandu', 'isglington', 24, 'f', 'BIT', 'tu')
(11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', 'IT', 'TU')
(8, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU')
(9, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'IT', 'UK')
(10, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'CE', 'PU')
(13, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU')
(14, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'IT', 'UK')
(15, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'CE', 'PU')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE', 'TU')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'TU')
(5, 'hari', 'kathmandu', 'ioe pulchowk', 24, 'm', 'CIVIL', 'ku')
(6, 'madan', 'pokhara', 'ncit', 21, 'f', 'SE', 'tu')
(7, 'maya', 'kathmandu', 'isglington', 24, 'f', 'BIT', 'tu')
(11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', 'IT', 'TU')
(8, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU')
(9, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'IT', 'UK')
(10, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'CE', 'PU')
(13, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU')
(14, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'IT', 'UK')
(15, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'CE', 'PU')

OperationalError: duplicate column name: university